export const TEAM_A = [
  "松岡 亮太",
  "安妻 玖透",
  "二宮 一颯",
  "来原 陸斗",
  "三宅 隼",
  "高﨑 晋太郎",
  "横江 恭平",
  "増井 優空",
  "伊與田 凱",
  "森本 裕月"
];

export const TEAM_B = [
  "入江 遙",
  "山本 悠人",
  "平尾 桜理",
  "入江 遼",
  "光神 佳輝",
  "西田 琴晴",
  "西川 真司",
  "渡邊 直斗",
  "宮崎 蒼大",
  "大村 琉惺",
  "佐想 新",
  "曽我部 悠貴",
  "酒井 結登"
];

export const COACH_A = [
  "松岡コーチ",
  "横江コーチ",
  "二宮コーチ",
  "森本コーチ",
  "三宅コーチ",
  "高﨑コーチ"
];

export const COACH_B = [
  "梶原コーチ",
  "田中コーチ",
  "川村コーチ",
  "大村コーチ",
  "入江コーチ",
  "西川コーチ"
];

// =========================
// 苗字取得
// =========================
export function getFamilyName(name) {

  if (!name) return "";

  return name.split(" ")[0];

}

// =========================
// コーチと子どもの対応
// =========================
export const COACH_CHILD = {

  "松岡コーチ": ["松岡 亮太"],
  "横江コーチ": ["横江 恭平"],
  "二宮コーチ": ["二宮 一颯"],
  "森本コーチ": ["森本 裕月"],
  "三宅コーチ": ["三宅 隼"],
  "高﨑コーチ": ["高﨑 晋太郎"],

  "梶原コーチ": [],
  "田中コーチ": [],
  "川村コーチ": [],
  "大村コーチ": ["大村 琉惺"],
  "入江コーチ": ["入江 遙","入江 遼"],
  "西川コーチ": ["西川 真司"]

};

// =========================
// 保護者と子どもの対応
// =========================
export const PARENT_CHILD = {

  "松岡さん": ["松岡 亮太"],
  "安妻さん": ["安妻 玖透"],
  "二宮さん": ["二宮 一颯"],
  "来原さん": ["来原 陸斗"],
  "三宅さん": ["三宅 隼"],
  "高﨑さん": ["高﨑 晋太郎"],
  "横江さん": ["横江 恭平"],
  "増井さん": ["増井 優空"],
  "伊與田さん": ["伊與田 凱"],
  "森本さん": ["森本 裕月"],

  "入江さん": ["入江 遙", "入江 遼"],
  "山本さん": ["山本 悠人"],
  "平尾さん": ["平尾 桜理"],
  "光神さん": ["光神 佳輝"],
  "西田さん": ["西田 琴晴"],
  "西川さん": ["西川 真司"],
  "渡邊さん": ["渡邊 直斗"],
  "宮崎さん": ["宮崎 蒼大"],
  "大村さん": ["大村 琉惺"],
  "佐想さん": ["佐想 新"],
  "曽我部さん": ["曽我部 悠貴"],
  "酒井さん": ["酒井 結登"]
}
  
};
